WITH inserted_teil AS (
  INSERT INTO teile (part_id, content, solution)
  SELECT
    p.id,
    jsonb_build_object(
      'title', 'Krista, der tierische Star',
      'photo', 'krista.jpg',
      'text', $$Krista ist die schönste Kuh Deutschlands. Und jetzt auch noch ein Kinostar. Am letzten Donnerstag kam ein Film über die schwarz-weiß gefleckte Kuh und ihre Besitzer in einige norddeutsche Kinos. Wovon der Film handelt? Von Kristas Leben auf dem Hof der Familie Seeger in Bissel, einem kleinen Dorf in Norddeutschland. Antje Schneider und Carsten Waldbauer sind Filmemacher. Vor einigen Jahren hatten sie die Idee, eine Dokumentation über Kühe zu machen, genauer gesagt über Holstein-Rinder. Die Holstein-Rinder sind eine der wichtigsten Rinderrassen weltweit, kommen aber trotz des deutschen Namens aus Nordamerika. Diese Kühe werden überwiegend als Milchvieh gehalten. Die Holstein-Rinder sind so verbreitet, dass sie inzwischen andere Rassen fast vollständig verdrängt haben. Das gilt vor allem für die vielen Bauernhöfe in Deutschland, die ausschließlich Milch produzieren. Auf einem dieser Höfe wollten Antje Schneider und Carsten Waldbauer Aufnahmen für ihre Dokumentation machen, und die Wahl fiel auf den Hof der Familie Seeger. Doch als die beiden Filmemacher mit den Dreharbeiten beginnen wollten, sahen sie plötzlich - Krista. Krista änderte alles. Die Schönheit vom Lande beeindruckte Schneider und Waldbauer so sehr, dass sie den Plan für ihre Dokumentation gegen den Willen ihres Senders komplett änderten. Im Mittelpunkt sollte nun Krista stehen, die schönste Holstein-Kuh Deutschlands. Krista gehört zur Weltelite. Auf Veranstaltungen wird sie immer wieder ausgezeichnet. Bei einer Tierschau in Italien erhielt sie zwar nicht den ersten Preis, aber trotzdem war sie unter den schönsten Kühen Europas. Kristas Besitzer Jörg Seeger ist begeistert von seinem Star im Stall. Jörg und Janine Seeger erlauben dem Kinozuschauer interessante Einblicke in ihren Alltag auf dem Bauernhof. Die Kamera verfolgt zwar immer den Weg von Kuh Krista, aber zu sehen ist dabei natürlich auch die Arbeit der gesamten Familie auf dem Hof. Manchmal ist das auch ein romantisches Leben, es ist aber vor allem immer sehr arbeitsreich. “Für mich sind Kühe nicht nur Nutztiere”, sagt die Bäuerin Janine Seeger. Schon als Kind hätten ihr die Tiere Geborgenheit, manchmal Trost gespendet. Aber sie weiß, dass die Kühe Geld bringen müssen, entweder durch möglichst viel Milch oder durch viel Nachwuchs. Die kleinen Kälber lassen sich zu recht guten Preisen verkaufen, das lohnt sich für die Seegers. Krista kann zunächst aus gesundheitlichen Gründen keine Kälber bekommen. Auch diese Problematik wird im Film gezeigt. Der Zuschauer merkt, dass Jörg Seeger enttäuscht ist: Seine beste Kuh kann kein Kalb bekommen. Aber es geht gut aus, denn Krista wird operiert und nach Ende der Dreharbeiten klappt es dann doch mit dem Nachwuchs für die Kuh. Während der jahrelangen Dreharbeiten hat sich auch die Familie entwickelt. Mittlerweile haben die Seegers zwei Kinder. “Deshalb verändert sich im Film mein Gewicht etwas”, erzählt Janine Seeger und lacht. Und wie ist es so, vor der Kamera zu stehen? “Erst ungewohnt, dann irgendwie vertraut”, sagt die 32-Jährige. Zu den Filmemachern habe sich ein freundschaftliches Verhältnis entwickelt. “Wie schön, Carsten und Antje sind wieder da”, habe es dann nur noch geheißen, wenn das Team anrückte. Der Film zeigt aber auch, wie sich im Laufe der Jahre das Leben auf dem Hof der Seegers verändert hat und wie schwierig es auch hier geworden ist, mit Milchkühen Geld zu verdienen. Der Markt ist hart umkämpft und die Preise sinken immer weiter, denn die Verbraucher im Supermarkt greifen gerne zum günstigsten Produkt. Für viele ist es da nicht wichtig, wie die Milch produziert wurde. Auch das zeigt der Film, wenngleich eher nebenbei. Familie Segeer ist stolz drauf, dass ein Film über ihren Hof und über die schöne Kuh Krista gedreht wurde. So heißt nun übrigens auch der Film: “Die schöne Krista”. Am vergangenen Wochenende haben die Seegers den Film bei einem Hoffest gezeigt. Familie und Freunde sowie Nachbarn waren zu Gast, und alle haben sich über den Film gefreut. “Die schöne Krista” ist auch die in die Auswahl für den Deutschen Filmpreis gekommen, als einer der fünfzehn besten Dokumentarfilme. Die 500 Filmkritiker, die diese 15 Filme ausgewählt haben, waren begeistert. Schwieriger sei es, so die Produktionsfirma, die Kinobetreiber vom Film zu überzeugen. “Was sollen wir mit einer Kuh?“, sei eine häufige Reaktion. Vielleicht würden sie ihre Meinung ändern, wenn Sie Krista einmal auf dem Hof gesehen hätten.$$,
      'questions', jsonb_build_array(
        jsonb_build_object(
          'id', 1,
          'question', 'Holstein-Rinder',
          'options', jsonb_build_object(
            'A', 'sind in der Milchproduktion beliebter als andere Rinderrassen.',
            'B', 'spielen in der Milchproduktion kaum eine Rolle.',
            'C', 'stammen aus Norddeutschland.'
          )
        ),
        jsonb_build_object(
          'id', 2,
          'question', 'Die Kuh Krista',
          'options', jsonb_build_object(
            'A', 'hat bereits einige Preise gewonnen.',
            'B', 'war Siegerin bei einer Veranstaltung in Italien.',
            'C', 'wurde als schönste Kuh Europas ausgezeichnet.'
          )
        ),
        jsonb_build_object(
          'id', 3,
          'question', 'Während der Filmaufnahmen',
          'options', jsonb_build_object(
            'A', 'bekam Krista ein Kalb.',
            'B', 'wäre Krista fast gestorben.',
            'C', 'wurde Krista operiert.'
          )
        ),
        jsonb_build_object(
          'id', 4,
          'question', 'Die wirtschaftlichen Probleme von Milchbetrieben',
          'options', jsonb_build_object(
            'A', 'betreffen die Familie Seeger nicht.',
            'B', 'sind eine Folge des Verbraucherverhaltens.',
            'C', 'werden im Film ausführlich behandelt.'
          )
        ),
        jsonb_build_object(
          'id', 5,
          'question', 'Die schöne Krista',
          'options', jsonb_build_object(
            'A', 'begeistert Kinobetreiber bislang nicht.',
            'B', 'könnte die Kritiker nicht überzeugen.',
            'C', 'wurde als beste Dokumentation ausgezeichnet.'
          )
        )
      )
    ),
    jsonb_build_object(
      '1','A',
      '2','A',
      '3','C',
      '4','B',
      '5','A'
    )
  FROM parts p
  WHERE p.part_number = 2
  RETURNING id AS teil_id, part_id
)
INSERT INTO theme_teile (theme_id, part_id, teil_id)
SELECT
  2 AS theme_id,
  2 AS part_id,
  it.teil_id
FROM inserted_teil it
RETURNING *;

